app/Http/Controllers/Consumables/ConsumableCheckoutController.php

select * from `consumables` where `consumables`.`id` = '1' and `consumables`.`deleted_at` is null limit 1
select `users`.*, `consumables_users`.`consumable_id` as `pivot_consumable_id`, `consumables_users`.`assigned_to` as `pivot_assigned_to`, `consumables_users`.`user_id` as `pivot_user_id`, `consumables_users`.`created_at` as `pivot_created_at`, `consumables_users`.`updated_at` as `pivot_updated_at` from `users` inner join `consumables_users` on `users`.`id` = `consumables_users`.`assigned_to` where `consumables_users`.`consumable_id` in (1)
---
    public function create($consumableId)
    {

        if (is_null($consumable = Consumable::with('users')->find($consumableId))) {

select * from `consumables` where `consumables`.`id` = '1' and `consumables`.`deleted_at` is null limit 1
select `users`.*, `consumables_users`.`consumable_id` as `pivot_consumable_id`, `consumables_users`.`assigned_to` as `pivot_assigned_to`, `consumables_users`.`user_id` as `pivot_user_id`, `consumables_users`.`created_at` as `pivot_created_at`, `consumables_users`.`updated_at` as `pivot_updated_at` from `users` inner join `consumables_users` on `users`.`id` = `consumables_users`.`assigned_to` where `consumables_users`.`consumable_id` in (1)
select * from `users` where `users`.`id` = '26' and `users`.`deleted_at` is null limit 1
---
    public function store(Request $request, $consumableId)
    {
        if (is_null($consumable = Consumable::with('users')->find($consumableId))) {
            return redirect()->route('consumables.index')->with('error', trans('admin/consumables/message.not_found'));
        }

        $this->authorize('checkout', $consumable);

        // Make sure there is at least one available to checkout
        if ($consumable->numRemaining() <= 0 || $request->qty > $consumable->numRemaining()) {
            return redirect()->route('consumables.index')->with('error', trans('admin/consumables/message.checkout.unavailable'));
        }


        $admin_user = Auth::user();
        $assigned_to = e($request->input('assigned_to'));

        // Check if the user exists
        if (is_null($user = User::find($assigned_to))) {