app/Http/Controllers/DashboardController.php

    public function index()
    {
        // Show the page
        if (auth()->user()->hasAccess('admin')) {
            $asset_stats = null;

            $counts['asset'] = \App\Models\Asset::count();
            $counts['accessory'] = \App\Models\Accessory::count();
            $counts['license'] = \App\Models\License::assetcount();
            $counts['consumable'] = \App\Models\Consumable::count();
            $counts['component'] = \App\Models\Component::count();
            $counts['user'] = \App\Models\Company::scopeCompanyables(auth()->user())->count();
---
select count(*) as aggregate from `assets` where `assets`.`deleted_at` is null
select count(*) as aggregate from `accessories` where `accessories`.`deleted_at` is null
select count(*) as aggregate from `consumables` where `consumables`.`deleted_at` is null
select count(*) as aggregate from `components` where `components`.`deleted_at` is null
select count(*) as aggregate from `users` where `users`.`company_id` = 6 and `users`.`deleted_at` is null