app/Http/Controllers/SuppliersController.php

insert into `suppliers` (`name`, `address`, `address2`, `city`, `state`, `country`, `zip`, `contact`, `phone`, `fax`, `email`, `notes`, `url`, `user_id`, `updated_at`, `created_at`) values ('bced', '', '', '', '', '', '', '', '', '', '', '', '', 26, '2024-06-05 11:44:57', '2024-06-05 11:44:57')
---
    public function store(ImageUploadRequest $request) : RedirectResponse
    {
        $this->authorize('create', Supplier::class);
        // Create a new supplier
        $supplier = new Supplier;
        // Save the location data
        $supplier->name = request('name');
        $supplier->address = request('address');
        $supplier->address2 = request('address2');
        $supplier->city = request('city');
        $supplier->state = request('state');
        $supplier->country = request('country');
        $supplier->zip = request('zip');
        $supplier->contact = request('contact');
        $supplier->phone = request('phone');
        $supplier->fax = request('fax');
        $supplier->email = request('email');
        $supplier->notes = request('notes');
        $supplier->url = $supplier->addhttp(request('url'));
        $supplier->user_id = Auth::id();
        $supplier = $request->handleImages($supplier);

        if ($supplier->save()) {

select * from `suppliers` where `suppliers`.`id` = '12' and `suppliers`.`deleted_at` is null limit 1
---
    public function edit($supplierId = null) : View | RedirectResponse
    {
        $this->authorize('update', Supplier::class);
        // Check if the supplier exists
        if (is_null($item = Supplier::find($supplierId))) {

select * from `suppliers` where `suppliers`.`id` = '9' and `suppliers`.`deleted_at` is null limit 1
---
    public function update($supplierId, ImageUploadRequest $request) : RedirectResponse
    {
        $this->authorize('update', Supplier::class);

        if (is_null($supplier = Supplier::find($supplierId))) {

select `suppliers`.*, (select count(*) from `asset_maintenances` where `suppliers`.`id` = `asset_maintenances`.`supplier_id` and `asset_maintenances`.`deleted_at` is null and (exists (select * from `assets` where `asset_maintenances`.`asset_id` = `assets`.`id` and `assets`.`company_id` = 6 and `assets`.`company_id` = 6))) as `asset_maintenances_count`, (select count(*) from `assets` where `suppliers`.`id` = `assets`.`supplier_id` and `assets`.`company_id` = 6 and `assets`.`deleted_at` is null) as `assets_count`, (select count(*) from `licenses` where `suppliers`.`id` = `licenses`.`supplier_id` and `licenses`.`deleted_at` is null and `licenses`.`company_id` = 6) as `licenses_count` from `suppliers` where `suppliers`.`id` = '12' and `suppliers`.`deleted_at` is null limit 1
update `suppliers` set `deleted_at` = '2024-06-05 19:53:51', `suppliers`.`updated_at` = '2024-06-05 19:53:51' where `id` = 12
---
    public function destroy($supplierId) : RedirectResponse
    {
        $this->authorize('delete', Supplier::class);
        if (is_null($supplier = Supplier::with('asset_maintenances', 'assets', 'licenses')->withCount('asset_maintenances as asset_maintenances_count', 'assets as assets_count', 'licenses as licenses_count')->find($supplierId))) {
            return redirect()->route('suppliers.index')->with('error', trans('admin/suppliers/message.not_found'));
        }

        if ($supplier->assets_count > 0) {
            return redirect()->route('suppliers.index')->with('error', trans('admin/suppliers/message.delete.assoc_assets', ['asset_count' => (int) $supplier->assets_count]));
        }

        if ($supplier->asset_maintenances_count > 0) {
            return redirect()->route('suppliers.index')->with('error', trans('admin/suppliers/message.delete.assoc_maintenances', ['asset_maintenances_count' => $supplier->asset_maintenances_count]));
        }

        if ($supplier->licenses_count > 0) {
            return redirect()->route('suppliers.index')->with('error', trans('admin/suppliers/message.delete.assoc_licenses', ['licenses_count' => (int) $supplier->licenses_count]));
        }

        $supplier->delete();

select * from `suppliers` where `suppliers`.`id` = '8' and `suppliers`.`deleted_at` is null limit 1
---
    public function show($supplierId = null) : View | RedirectResponse
    {
        $this->authorize('view', Supplier::class);
        $supplier = Supplier::find($supplierId);